/*! @file
<PRE>
********************************************************************************
模块名       :	分离器
文件名       :	splitter.cpp
文件实现功能 :  分离器
作者         :  gw
版本         :  V1.00
--------------------------------------------------------------------------------
备注         : <其它说明>
--------------------------------------------------------------------------------
修改记录 :
日 期        版本     修改人              修改内容

********************************************************************************
</PRE>
*  @brief  
*  @author gw
*  @version 1.0
*  @date    2015.11.15
*/

#include "splitter.h"

/*! \fn CSplitter::CSplitter(QWidget *parent)
********************************************************************************************************* 
** \brief CSplitter::CSplitter 
** \details 
** \param parent 
** \return  
** \author gw
** \date 2015年11月16日 
** \note 
********************************************************************************************************/
CSplitter::CSplitter(QWidget *parent)
	: QSplitter(parent)
{

}

/*! \fn CSplitter::~CSplitter()
********************************************************************************************************* 
** \brief CSplitter::~CSplitter 
** \details 
** \return  
** \author gw
** \date 2015年11月16日 
** \note 
********************************************************************************************************/
CSplitter::~CSplitter()
{

}

/*! \fn void CSplitter::SetOri(Qt::Orientation ori)
********************************************************************************************************* 
** \brief CSplitter::setOri 
** \details 设置分离器方向
** \param ori 
** \return void 
** \author gw
** \date 2015年10月23日 
** \note 
********************************************************************************************************/
void CSplitter::SetOri(Qt::Orientation ori)
{
	setOrientation(ori);
}