
/*! @file scdsvc_define.h
<PRE>
********************************************************************************
模块名       :
文件名       :  scdsvc_define.h
文件实现功能 :  前置数据定义
作者         :  Zhu Yongjin
版本         :  V1.00
--------------------------------------------------------------------------------
备注         :  <其它说明>
--------------------------------------------------------------------------------
修改记录 :
日 期        版本     修改人              修改内容

********************************************************************************
</PRE>
*  @brief     scada宏定义
*  @author    Zhu Yongjin
*  @version   1.0
*  @date      2016.10.14
*******************************************************************************/
#ifndef SCDSVC_DEFINE_H
#define SCDSVC_DEFINE_H

#define MAX_POOL_NAME_LEN   128

// 存储共享内存文件目录名
#define REAL_FOLDER     "/real/"

// 存储备份目录名
#define BAK_FOLDER      "/backup/"

// AI共享内存名
#define AI_MEM_NAME     "ai"

// DI共享内存名
#define DI_MEM_NAME     "di"



#endif // SCDSVC_DEFINE_H
