/*! @file sub_svc.cpp
<PRE>
********************************************************************************
模块名       :
文件名       :  sub_svc.cpp
文件实现功能 :	订阅服务
作者         :  LiJin
版本         :  V1.00
--------------------------------------------------------------------------------
备注         :  <其它说明>
--------------------------------------------------------------------------------
修改记录 :
日 期        版本     修改人              修改内容

********************************************************************************
</PRE>
*  @brief   订阅服务
*  @author  LiJin
*  @version 1.0
*  @date    2016.11.03
*******************************************************************************/
#include "subscription_list.h"
#include "log/log.h"
 

#include <QObject> 
#include <QString> 


CSubScriptionList::CSubScriptionList()
{

}

CSubScriptionList::~CSubScriptionList()
{
	m_setAins.clear();
	m_setDins.clear();
}




/** @}*/
