/*! @file nb_svc.cpp
<PRE>
********************************************************************************
模块名       :
文件名       :  nb_svc.cpp
文件实现功能 :  网络接口模块
作者         :  LiJin
版本         :  V1.00
--------------------------------------------------------------------------------
备注         :  <其它说明>
--------------------------------------------------------------------------------
修改记录 :
日 期        版本     修改人              修改内容

********************************************************************************
</PRE>
*  @brief   网络接口模块
*  @author  LiJin
*  @version 1.0
*  @date    2016.09.01
*******************************************************************************/

#include "data_size.h"
#include <QDebug>

std::array<int32u, DT_MAX> CIoDataType::m_arrDataSize =
{
	0,      //DT_NULL = 0,
	1,	   	//DT_BOOLEAN = 1,	  //!< 布尔，8位，缺省值0
	1,	   	//DT_CHAR = 2,      //!< 有符号字节（8位）
	1,	   	//DT_BYTE = 3,      //!< 无符号字节（8位）
	2,	   	//DT_SHORT = 4,     //!< 无符号短整数 ，16位， 
	2,	   	//DT_WORD = 5,      //!< 无符短整数 ，16位
	4,	   	//DT_INT = 6,       //!< 有符号长整数 32位
	4,	   	//DT_DWORD = 7,      //!< 无符号长整数 32位
	8,	   	//DT_LLONG = 8,      //!< 有符号长整数  64位
	8,	   	//DT_LWORD = 9,      //!< 无符号长整数  64位
	4,	   	//DT_FLOAT = 10,
	8,	   	//DT_DOUBLE = 11,
	1,	   	//DT_STRING = 12,
	1,	   	//DT_BLOCK = 13,
//	0 	   	//DT_MAX
};


int32u CIoDataType::GetDataSize(INT32U nDT)
{
	Q_ASSERT(nDT < DT_MAX);
	if (nDT >= DT_MAX)
		return 0;

	return m_arrDataSize[nDT];
}

 
/** @}*/
