/*! @file graph_folder.h
<PRE>
********************************************************************************
模块名       :
文件名       : graph_folder.h
文件实现功能 : 图形文件
作者         :  LiJin
版本         :  V1.00
--------------------------------------------------------------------------------
备注         : <其它说明>
--------------------------------------------------------------------------------
修改记录 :
日 期        版本     修改人              修改内容

********************************************************************************
</PRE>
*  @brief  基本定义
*  @author LiJin
*  @version 1.0
*  @date    2014.09.11
*******************************************************************************/
#include "graph_folder.h"

  
CGraphFolder::CGraphFolder()
{

}

CGraphFolder::~CGraphFolder()
{
	//	FreeMem();
//	STLDeleteElements(&m_arrPics);
}


/** @}*/

