/*! @file line_widget.h
<PRE>
********************************************************************************
模块名       :
文件名       : line_widget.h
文件实现功能 : 图层
作者         :  LiJin
版本         :  V1.00
--------------------------------------------------------------------------------
备注         : <其它说明>
--------------------------------------------------------------------------------
修改记录 :
日 期        版本     修改人              修改内容

********************************************************************************
</PRE>
*  @brief  图层
*  @author LiJin
*  @version 1.0
*  @date    2014.09.11
*******************************************************************************/


#ifndef D_LINE_WIDGET_H
#define D_LINE_WIDGET_H
 
#include "base_widget.h"
  
class CLineWidget : public CBaseWidget
{
public:
	CLineWidget();
	~CLineWidget();
public:
	
	 
protected:
 
private:

};


#endif // D_LINE_WIDGET_H


/** @}*/
