/*! @file node.h
<PRE>
********************************************************************************
模块名       :
文件名       :  node.h
文件实现功能 :  系统的节点定义
作者         :  LiJin
版本         :  V1.00
--------------------------------------------------------------------------------
备注         :   
--------------------------------------------------------------------------------
修改记录 :
日 期        版本     修改人              修改内容

********************************************************************************
</PRE>
*  @brief   系统的节点定义
*  @author  LiJin
*  @version 1.0
*  @date    2016.09.16
*******************************************************************************/
#ifndef NODE_H
#define NODE_H

#include "datatypes.h"

struct NODE;

class CNode
{
public:
	CNode();
	explicit CNode(NODE *pNode);
	~CNode();
public:

private:
	int32u m_nOccNo;

};

#endif // NODE_H


/** @}*/

