/*! @file node.cpp
<PRE>
********************************************************************************
模块名       :
文件名       :  node.cpp
文件实现功能 :  系统的节点定义
作者         :  LiJin
版本         :  V1.00
--------------------------------------------------------------------------------
备注         :  <其它说明>
--------------------------------------------------------------------------------
修改记录 :
日 期        版本     修改人              修改内容

********************************************************************************
</PRE>
*  @brief   系统的节点定义
*  @author  LiJin
*  @version 1.0
*  @date    2016.09.16
*******************************************************************************/

#include "node.h"
#include "fesapi/fesdatadef.h"


#include "log/log.h"  

#include <QObject>
 

CNode::CNode()
{

}

CNode::~CNode()
{

}

CNode::CNode(NODE *pNode)
{
	Q_ASSERT(pNode);
	if (pNode == nullptr)
		return;

	m_nOccNo = pNode->OccNo;
}


/** @}*/
