/*! @file main_task.c
<PRE>
********************************************************************************
模块名       : 通信主任务
文件名       : main_task.c
文件实现功能 :  
作者         :
版本         :
--------------------------------------------------------------------------------
备注         : <其它说明>
--------------------------------------------------------------------------------
修改记录 :
日 期        版本     修改人              修改内容

********************************************************************************
</PRE>
*  @brief  任务入口.
*  @author LiJin
*  @version 1.0
*  @date    2010.02.16
*******************************************************************************/ 


#include "fesapi\fesapi.h"

extern void RecvMailDoNull();




/*! \fn void MainTask()
********************************************************************************************************* 
** \brief MainTask 
** \details 线程主函数
** \return void 
** \author LiJin 
** \date 2015年9月8日 
** \note 伪码 
********************************************************************************************************/
void MainTask()
{
	unsigned int nHostState = 0;

	while(true)
	{
		// 如果前置引擎退出
	//	if (IsFesAlive() != true)
		{
			break;
		}
		// 判断主从状态
	//	nHostState = GetHostState();
		if (nHostState == 0 )
		{ // 如果在从机状态
			//收引擎发来来的消息
		//	RecvMailDoNull();
			continue;
		}
		else
		{// 如果在主机
			

			// 1.设置端口状态，设置装置的通信状态

			// 2.接收前置发来的消息并做处理 

			// 3.召唤应答


		}

	}

}


/*@}*/
